###############################################################
#  Generated by:      Cadence Encounter 14.28-s033_1
#  OS:                Linux x86_64(Host ID csl-401-03.csl.illinois.edu)
#  Generated on:      Wed Apr  3 13:25:29 2019
#  Design:            delta_sigma1bit
#  Command:           saveDesign delta_sigma1bit.finished.enc
###############################################################
current_design delta_sigma1bit
create_clock [get_ports {clk}]  -name my_clk -period 1000.000000 -waveform {0.000000 500.000000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {rstb}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {rstb}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {rstb}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {rstb}]
set_max_fanout 1  [get_ports {rstb}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {clk}]
set_max_fanout 1  [get_ports {clk}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[14]}]
set_max_fanout 1  [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[13]}]
set_max_fanout 1  [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[12]}]
set_max_fanout 1  [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[11]}]
set_max_fanout 1  [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[10]}]
set_max_fanout 1  [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[9]}]
set_max_fanout 1  [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[8]}]
set_max_fanout 1  [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[7]}]
set_max_fanout 1  [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[6]}]
set_max_fanout 1  [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[5]}]
set_max_fanout 1  [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[4]}]
set_max_fanout 1  [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[3]}]
set_max_fanout 1  [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[2]}]
set_max_fanout 1  [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[1]}]
set_max_fanout 1  [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {din[0]}]
set_max_fanout 1  [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {sdoutexten}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {sdoutexten}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {sdoutexten}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {sdoutexten}]
set_max_fanout 1  [get_ports {sdoutexten}]
set_driving_cell -lib_cell INVX1BA10TR -rise -min -pin Y [get_ports {sdoutext}]
set_driving_cell -lib_cell INVX1BA10TR -fall -min -pin Y [get_ports {sdoutext}]
set_driving_cell -lib_cell INVX1BA10TR -rise -max -pin Y [get_ports {sdoutext}]
set_driving_cell -lib_cell INVX1BA10TR -fall -max -pin Y [get_ports {sdoutext}]
set_max_fanout 1  [get_ports {sdoutext}]
set_load -pin_load -max  0.04  [get_ports {sdout}]
set_load -pin_load -min  0.04  [get_ports {sdout}]
set_wire_load_model -library scadv10_cln65gp_rvt_ss_0p9v_125c -max -name tsmc65_wl10
set_wire_load_model -library scadv10_cln65gp_rvt_ss_0p9v_125c -min -name tsmc65_wl10
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[11]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[9]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[7]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[5]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[3]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {rstb}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[1]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[14]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[12]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {sdoutexten}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[10]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[8]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[6]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {sdoutext}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[4]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[2]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[0]}]
set_input_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {din[13]}]
set_output_delay -add_delay 2.5 -clock [get_clocks {my_clk}] [get_ports {sdout}]
set_clock_uncertainty 0.1 [get_clocks {my_clk}]
set_false_path  -from [get_ports {rstb}] 
